src/InformationRegisters/УР_ПроизводственныйКалендарь.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<InformationRegister>
		<Properties>
			<Name>УР_ПроизводственныйКалендарь</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Пятидневка</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>2</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Шестидневка</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>2</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КалендарныеДни</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>2</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ВидДня</Name>
					<Type>
						<v8:Type>cfg:EnumRef.УР_ВидыДнейПроизводственногоКалендаря</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ДатаКалендаря</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Год</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>4</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/Enums/УР_ВидыДнейПроизводственногоКалендаря.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<Enum>
		<Properties>
			<Name>УР_ВидыДнейПроизводственногоКалендаря</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Рабочий</Name>
					<Comment>Рабочий день</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Суббота</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Воскресенье</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Предпраздничный</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Праздник</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/InformationRegisters/УР_ПроизводственныйКалендарь/Forms/ФормаВводаДаты/module.bsl
// Виды дней
Перем ВидДняРабочий;
Перем ВидДняПраздник;
Перем ВидДняПредпраздничный;

Перем ИсходнаяДата;

Функция ПроверитьПравильностьВыбораДаты()
	
	ВыбраннаяДата = ИсходнаяДата;
	ВыбраннаяДатаПереноса = КалендарнаяДата;
	
	Если ВыбраннаяДата = ВыбраннаяДатаПереноса Тогда
		Предупреждение("Выбраны одинаковые даты!");
		Возврат Ложь;
	КонецЕсли;
	
	ГодВыбраннойДаты = Год(ВыбраннаяДата);
	
	Если (ГодВыбраннойДаты <> Год(ВыбраннаяДатаПереноса)) Тогда
		Предупреждение("Выбираемая дата должна быть из "+Строка(ГодВыбраннойДаты)+" года");
		Возврат Ложь;
	КонецЕсли;
	
	ДеньНеделиВыбраннойДаты = ДеньНедели(ВыбраннаяДата);
	ДеньНеделиВыбраннойДатыПереноса = ДеньНедели(ВыбраннаяДатаПереноса);
	ВыбраннаяДатаЭтоВыходной = (ДеньНеделиВыбраннойДаты = 6) Или (ДеньНеделиВыбраннойДаты = 7);
	ВыбраннаяДатаПереносаЭтоВыходной = (ДеньНеделиВыбраннойДатыПереноса = 6) ИЛИ (ДеньНеделиВыбраннойДатыПереноса = 7); 
	
	СтрокаВыбраннойДаты = ТаблицаРегистра.Найти(ВыбраннаяДата, "ДатаКалендаря");
	Если СтрокаВыбраннойДаты <> Неопределено Тогда
		ВыбраннаяДатаЭтоПраздник = 	СтрокаВыбраннойДаты.ВидДня = ВидДняПраздник;
	Иначе
		ВыбраннаяДатаЭтоПраздник = Ложь;
	КонецЕсли;
	
	СтрокаВыбраннойДатыПереноса = ТаблицаРегистра.Найти(ВыбраннаяДатаПереноса, "ДатаКалендаря");
	Если СтрокаВыбраннойДатыПереноса <> Неопределено Тогда
		ВыбраннаяДатаПереносаЭтоПраздник = СтрокаВыбраннойДатыПереноса.ВидДня = ВидДняПраздник;
	Иначе
		ВыбраннаяДатаПереносаЭтоПраздник = Ложь;
	КонецЕсли;
	
	НачальнаяЧастьСтрокиПредупреждения = формат(ВыбраннаяДата, "ДФ = ""д ММММ, дддд""")+" на "+
			формат(ВыбраннаяДатаПереноса, "ДФ = ""д ММММ, дддд""")+".";
			
	Если (ВыбраннаяДатаЭтоВыходной И ВыбраннаяДатаПереносаЭтоВыходной) 

		ИЛИ (НЕ ВыбраннаяДатаЭтоВыходной И НЕ ВыбраннаяДатаПереносаЭтоВыходной
			И НЕ ВыбраннаяДатаПереносаЭтоПраздник) Тогда
		
		Предупреждение("Вы выполняете перенос "+НачальнаяЧастьСтрокиПредупреждения + " При переносе "+
			?(ВыбраннаяДатаЭтоВыходной, "праздничного дня вы можете выбрать только рабочий день.",
			"рабочего дня вы можете выбрать только праздничный день."));
		Возврат Ложь;
	КонецЕсли;

	Возврат Истина;
КонецФункции

Процедура ОсновныеДействияФормыОК(Кнопка)
	
	Если ПроверитьПравильностьВыбораДаты() Тогда
		Закрыть(КалендарнаяДата);
	КонецЕсли;
	
КонецПроцедуры

Процедура УстановитьЗаголовокФормы(ТекстПояснения) Экспорт
	
	ЭлементыФормы.Пояснение.Заголовок = ТекстПояснения;
	
КонецПроцедуры

Процедура КалендарнаяДатаВыбор(Элемент, ВыбраннаяДата)
	
	Если ПроверитьПравильностьВыбораДаты() Тогда
		Закрыть(КалендарнаяДата);
	КонецЕсли;
	
КонецПроцедуры

Процедура ПриОткрытии()
	
	ИсходнаяДата = КалендарнаяДата;
	
	ВидДняРабочий = Перечисления.УР_ВидыДнейПроизводственногоКалендаря.Рабочий;
	ВидДняПраздник = Перечисления.УР_ВидыДнейПроизводственногоКалендаря.Праздник;
	ВидДняПредпраздничный = Перечисления.УР_ВидыДнейПроизводственногоКалендаря.Предпраздничный;

КонецПроцедуры
